app/controllers/api/houses_controller.rb

    def index
        houses = bounds ? House.in_bounds(bounds) : House.all
        @houses = houses.includes(:reviews, :rentals)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."house_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["house_id", 1], ["house_id", 2], ["house_id", 3], ["house_id", 4], ["house_id", 5], ["house_id", 6], ["house_id", 7], ["house_id", 8], ["house_id", 9], ["house_id", 10]]