app/controllers/api/rental_infos_controller.rb

    def create

        @rental_info = current_user.rentals.new(rental_params)

        if @rental_info.save
---
INSERT INTO "rental_infos" ("user_id", "house_id", "check_in", "check_out", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def destroy
        @rental_info = current_user.rentals.find_by(params[:house_id])
        @rental_info.destroy
---
DELETE FROM "rental_infos" WHERE "rental_infos"."id" = $1  [["id", 16]]