app/controllers/api/reviews_controller.rb

INSERT INTO "reviews" ("user_id", "house_id", "score", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 3], ["house_id", 106], ["score", 4], ["body", "Not bad"], ["created_at", "2021-06-09 19:37:32.896712"], ["updated_at", "2021-06-09 19:37:32.896712"]]
---
    def create
      @review = current_user.reviews.new(review_params)

      if @review.save