app/views/api/houses/show.json.jbuilder

SELECT "reviews"."id" FROM "reviews" WHERE "reviews"."house_id" = $1  [["house_id", 86]]
---
    json.partial! '/api/houses/house', house: @house
    json.reviewIds @house.reviews.pluck(:id)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."house_id" = $1  [["house_id", 86]]
---

@house.reviews.includes(:author).each do |review|